---
type: CylindricalSurface
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# CylindricalSurface

`Autodesk.Revit.DB.CylindricalSurface` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2017 | `public static CylindricalSurface Create ( Frame frameOfReference , double radius )` |
| Method | GetFrameOfReference | 2017 | `public Frame GetFrameOfReference ()` |
| Property | Axis | 2017 | `public XYZ Axis { get ; }` |
| Property | Origin | 2017 | `public XYZ Origin { get ; }` |
| Property | Radius | 2017 | `public double Radius { get ; }` |
| Property | XDir | 2017 | `public XYZ XDir { get ; }` |
| Property | YDir | 2017 | `public XYZ YDir { get ; }` |